import pytest


@pytest.fixture
def valid_card_numbers():  # Допустимые номера карт
    return [
        ("7000792289606361", "7000 79** **** 6361"),
        ("1234567890123456", "1234 56** **** 3456"),
        ("5555666677778888", "5555 66** **** 8888"),
    ]


@pytest.fixture
def invalid_card_numbers():
    return [
        "1234567",  # Меньше 16 цифр
        "12345678901234567",  # Больше 16 цифр
        "1234abcd89012345",  # Буквы
        "7000-7922-8960-6361",  # Символы
        "12345678901234a6",  # Буква среди цифр
    ]


@pytest.fixture
def valid_mask_input_case():
    return [
        ("Visa Platinum 7000792289606361", "Visa Platinum 7000 79** **** 6361"),
        ("Счет 73654108430135874305", "Счет **4305"),
        ("MasterCard Gold 1234567890123456", "MasterCard Gold 1234 56** **** 3456"),
        ("Счет 12345678901234567890", "Счет **7890"),
    ]


@pytest.fixture
def invalid_mask_input_case():
    return [
        (
            "Visa 1234567",  # слишком короткий номер карты
            "MasterCard 12345678901234567",  # слишком длинный номер карты
            "Счет 1234567890",  # короткий счет
            "Счет 123456789012345678901",  # длинный счет
            "Visa Platinum 1234abcd89012345",  # буквы в номере карты
            "Счет 12345678901234567abc",  # буквы в номере счета
            "MasterCard 1234-5678-9012-3456",  # дефисы в карте
            "Счет 7365-4108-4301-3587-4305",  # дефисы в счете
            "",
        )
    ]


@pytest.fixture
def valid_date():
    return [
        ("2024-06-05T14:30:00", "05.06.2024"),  # стандартный случай
        ("2000-01-01T00:00:00", "01.01.2000"),  # начало века
        ("1999-12-31T23:59:59", "31.12.1999"),  # конец года
        ("2023-02-28T00:00:00", "28.02.2023"),  # не високосный год
        ("2020-02-29T12:34:56", "29.02.2020"),  # високосный год
        ("1970-01-01T00:00:00", "01.01.1970"),  # граничная дата эпохи Unix
    ]


@pytest.fixture
def invalid_date():
    return [
        (
            "2024/06/05 14:30:00",  # неверный разделитель
            "05-06-2024T14:30:00",  # день-месяц-год
            "2024-13-01T00:00:00",  # несуществующий месяц
            "2024-00-01T00:00:00",  # нулевой месяц
            "2024-06-32T00:00:00",  # несуществующий день
            "",  # пустая строка
            "abcde",  # случайная строка
            "20240605T143000",  # без разделителей
            "2024-06-05",  # только дата без времени
            "14:30:00",  # только время без даты
            None,
        )  # отсутствие даты (None)
    ]


@pytest.fixture
def sample_data():
    return [
        {"id": 1, "state": "EXECUTED", "date": "2024-01-01T10:00:00"},
        {"id": 2, "state": "PENDING", "date": "2024-01-02T11:00:00"},
        {"id": 3, "state": "FAILED", "date": "2024-01-03T12:00:00"},
        {"id": 4, "state": "EXECUTED", "date": "2024-01-04T13:00:00"},
        {"id": 5, "date": "2024-01-05T14:00:00"},  # без ключа 'state'
    ]
