import pytest


@pytest.fixture
def valid_card_numbers(): #Допустимые номера карт
    return [
        ("7000792289606361", "7000 79** **** 6361"),
        ("1234567890123456", "1234 56** **** 3456"),
        ("5555666677778888", "5555 66** **** 8888")
    ]

@pytest.fixture
def invalid_card_numbers():
    return [
        "1234567",  # Меньше 16 цифр
        "12345678901234567",  # Больше 16 цифр
        "1234abcd89012345",  # Буквы
        "7000-7922-8960-6361",  # Символы
        "12345678901234a6"  # Буква среди цифр
    ]

@pytest.fixture
def valid_mask_input_case():
    return [("Visa Platinum 7000792289606361", "Visa Platinum 7000 79** **** 6361"),
    ("Счет 73654108430135874305", "Счет **4305"),
    ("MasterCard Gold 1234567890123456", "MasterCard Gold 1234 56** **** 3456"),
    ("Счет 12345678901234567890", "Счет **7890")
              ]